; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=5, packages=13, locations=13, density=0.19230769230769232, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=27, seed=68

(define (problem transport-27)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l12)
    (at p3 l11)
    (at p4 l6)
    (at p5 l8)
    (at p6 l9)
    (at p7 l6)
    (at p8 l3)
    (at p9 l9)
    (at p10 l11)
    (at p11 l13)
    (at p12 l13)
    (at p13 l13)
    (at v1 l2)
    (at v2 l1)
    (at v3 l9)
    (at v4 l12)
    (at v5 l8)
    (road l5 l9)
    (road l10 l11)
    (road l12 l5)
    (road l4 l12)
    (road l5 l1)
    (road l7 l11)
    (road l7 l2)
    (road l11 l10)
    (road l5 l12)
    (road l1 l5)
    (road l9 l11)
    (road l12 l3)
    (road l6 l4)
    (road l11 l9)
    (road l9 l5)
    (road l2 l7)
    (road l11 l7)
    (road l9 l13)
    (road l3 l12)
    (road l4 l6)
    (road l8 l12)
    (road l12 l4)
    (road l13 l9)
    (road l12 l8)
    (road l7 l10)
    (road l10 l7)
    (road l4 l9)
    (road l9 l4)
    (road l2 l12)
    (road l12 l2)
    )
 (:goal  (and 
    (at p1 l7)
    (at p2 l9)
    (at p3 l13)
    (at p4 l2)
    (at p5 l12)
    (at p6 l5)
    (at p7 l11)
    (at p8 l7)
    (at p9 l6)
    (at p10 l2)
    (at p11 l12)
    (at p12 l3)
    (at p13 l4))))

; plan
1. (drive v4 l12 l3)
   deleted: (at v4 l12)
   added: (at v4 l3)
   goals met: 0 of 13
2. (pick-up v4 l3 p8 c1 c2)
   deleted: (at p8 l3) (capacity v4 c2)
   added: (in p8 v4) (capacity v4 c1)
   goals met: 0 of 13
3. (drive v3 l9 l4)
   deleted: (at v3 l9)
   added: (at v3 l4)
   goals met: 0 of 13
4. (drive v4 l3 l12)
   deleted: (at v4 l3)
   added: (at v4 l12)
   goals met: 0 of 13
5. (drive v4 l12 l8)
   deleted: (at v4 l12)
   added: (at v4 l8)
   goals met: 0 of 13
6. (pick-up v4 l8 p5 c0 c1)
   deleted: (at p5 l8) (capacity v4 c1)
   added: (in p5 v4) (capacity v4 c0)
   goals met: 0 of 13
7. (drive v4 l8 l12)
   deleted: (at v4 l8)
   added: (at v4 l12)
   goals met: 0 of 13
8. (drop v4 l12 p5 c0 c1)
   deleted: (in p5 v4) (capacity v4 c0)
   added: (at p5 l12) (capacity v4 c1)
   goals met: 1 of 13
9. (drive v4 l12 l5)
   deleted: (at v4 l12)
   added: (at v4 l5)
   goals met: 1 of 13
10. (pick-up v4 l5 p1 c0 c1)
   deleted: (at p1 l5) (capacity v4 c1)
   added: (in p1 v4) (capacity v4 c0)
   goals met: 1 of 13
11. (drive v4 l5 l12)
   deleted: (at v4 l5)
   added: (at v4 l12)
   goals met: 1 of 13
12. (drive v4 l12 l2)
   deleted: (at v4 l12)
   added: (at v4 l2)
   goals met: 1 of 13
13. (drive v4 l2 l7)
   deleted: (at v4 l2)
   added: (at v4 l7)
   goals met: 1 of 13
14. (drop v4 l7 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l7) (capacity v4 c1)
   goals met: 2 of 13
15. (drop v4 l7 p8 c1 c2)
   deleted: (in p8 v4) (capacity v4 c1)
   added: (at p8 l7) (capacity v4 c2)
   goals met: 3 of 13
16. (drive v4 l7 l11)
   deleted: (at v4 l7)
   added: (at v4 l11)
   goals met: 3 of 13
17. (pick-up v4 l11 p10 c1 c2)
   deleted: (at p10 l11) (capacity v4 c2)
   added: (in p10 v4) (capacity v4 c1)
   goals met: 3 of 13
18. (pick-up v4 l11 p3 c0 c1)
   deleted: (at p3 l11) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 3 of 13
19. (drive v4 l11 l7)
   deleted: (at v4 l11)
   added: (at v4 l7)
   goals met: 3 of 13
20. (drive v4 l7 l2)
   deleted: (at v4 l7)
   added: (at v4 l2)
   goals met: 3 of 13
21. (drop v4 l2 p10 c0 c1)
   deleted: (in p10 v4) (capacity v4 c0)
   added: (at p10 l2) (capacity v4 c1)
   goals met: 4 of 13
22. (drive v4 l2 l12)
   deleted: (at v4 l2)
   added: (at v4 l12)
   goals met: 4 of 13
23. (drive v4 l12 l5)
   deleted: (at v4 l12)
   added: (at v4 l5)
   goals met: 4 of 13
24. (drive v4 l5 l9)
   deleted: (at v4 l5)
   added: (at v4 l9)
   goals met: 4 of 13
25. (pick-up v4 l9 p6 c0 c1)
   deleted: (at p6 l9) (capacity v4 c1)
   added: (in p6 v4) (capacity v4 c0)
   goals met: 4 of 13
26. (drive v4 l9 l13)
   deleted: (at v4 l9)
   added: (at v4 l13)
   goals met: 4 of 13
27. (drop v4 l13 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l13) (capacity v4 c1)
   goals met: 5 of 13
28. (pick-up v4 l13 p11 c0 c1)
   deleted: (at p11 l13) (capacity v4 c1)
   added: (in p11 v4) (capacity v4 c0)
   goals met: 5 of 13
29. (drive v4 l13 l9)
   deleted: (at v4 l13)
   added: (at v4 l9)
   goals met: 5 of 13
30. (drive v4 l9 l5)
   deleted: (at v4 l9)
   added: (at v4 l5)
   goals met: 5 of 13
31. (drop v4 l5 p6 c0 c1)
   deleted: (in p6 v4) (capacity v4 c0)
   added: (at p6 l5) (capacity v4 c1)
   goals met: 6 of 13
32. (drive v4 l5 l12)
   deleted: (at v4 l5)
   added: (at v4 l12)
   goals met: 6 of 13
33. (drop v4 l12 p11 c1 c2)
   deleted: (in p11 v4) (capacity v4 c1)
   added: (at p11 l12) (capacity v4 c2)
   goals met: 7 of 13
34. (drive v3 l4 l12)
   deleted: (at v3 l4)
   added: (at v3 l12)
   goals met: 7 of 13
35. (drive v3 l12 l2)
   deleted: (at v3 l12)
   added: (at v3 l2)
   goals met: 7 of 13
36. (pick-up v4 l12 p2 c1 c2)
   deleted: (at p2 l12) (capacity v4 c2)
   added: (in p2 v4) (capacity v4 c1)
   goals met: 7 of 13
37. (drive v4 l12 l4)
   deleted: (at v4 l12)
   added: (at v4 l4)
   goals met: 7 of 13
38. (drive v4 l4 l9)
   deleted: (at v4 l4)
   added: (at v4 l9)
   goals met: 7 of 13
39. (drop v4 l9 p2 c1 c2)
   deleted: (in p2 v4) (capacity v4 c1)
   added: (at p2 l9) (capacity v4 c2)
   goals met: 8 of 13
40. (pick-up v4 l9 p9 c1 c2)
   deleted: (at p9 l9) (capacity v4 c2)
   added: (in p9 v4) (capacity v4 c1)
   goals met: 8 of 13
41. (drive v3 l2 l12)
   deleted: (at v3 l2)
   added: (at v3 l12)
   goals met: 8 of 13
42. (drive v4 l9 l4)
   deleted: (at v4 l9)
   added: (at v4 l4)
   goals met: 8 of 13
43. (drive v4 l4 l6)
   deleted: (at v4 l4)
   added: (at v4 l6)
   goals met: 8 of 13
44. (pick-up v4 l6 p7 c0 c1)
   deleted: (at p7 l6) (capacity v4 c1)
   added: (in p7 v4) (capacity v4 c0)
   goals met: 8 of 13
45. (drop v4 l6 p9 c0 c1)
   deleted: (in p9 v4) (capacity v4 c0)
   added: (at p9 l6) (capacity v4 c1)
   goals met: 9 of 13
46. (pick-up v4 l6 p4 c0 c1)
   deleted: (at p4 l6) (capacity v4 c1)
   added: (in p4 v4) (capacity v4 c0)
   goals met: 9 of 13
47. (drive v3 l12 l4)
   deleted: (at v3 l12)
   added: (at v3 l4)
   goals met: 9 of 13
48. (drive v4 l6 l4)
   deleted: (at v4 l6)
   added: (at v4 l4)
   goals met: 9 of 13
49. (drive v4 l4 l12)
   deleted: (at v4 l4)
   added: (at v4 l12)
   goals met: 9 of 13
50. (drive v4 l12 l2)
   deleted: (at v4 l12)
   added: (at v4 l2)
   goals met: 9 of 13
51. (drop v4 l2 p4 c0 c1)
   deleted: (in p4 v4) (capacity v4 c0)
   added: (at p4 l2) (capacity v4 c1)
   goals met: 10 of 13
52. (drive v4 l2 l7)
   deleted: (at v4 l2)
   added: (at v4 l7)
   goals met: 10 of 13
53. (drive v4 l7 l11)
   deleted: (at v4 l7)
   added: (at v4 l11)
   goals met: 10 of 13
54. (drop v4 l11 p7 c1 c2)
   deleted: (in p7 v4) (capacity v4 c1)
   added: (at p7 l11) (capacity v4 c2)
   goals met: 11 of 13
55. (drive v3 l4 l9)
   deleted: (at v3 l4)
   added: (at v3 l9)
   goals met: 11 of 13
56. (drive v3 l9 l13)
   deleted: (at v3 l9)
   added: (at v3 l13)
   goals met: 11 of 13
57. (pick-up v3 l13 p12 c0 c1)
   deleted: (at p12 l13) (capacity v3 c1)
   added: (in p12 v3) (capacity v3 c0)
   goals met: 11 of 13
58. (drive v3 l13 l9)
   deleted: (at v3 l13)
   added: (at v3 l9)
   goals met: 11 of 13
59. (drive v3 l9 l4)
   deleted: (at v3 l9)
   added: (at v3 l4)
   goals met: 11 of 13
60. (drive v3 l4 l12)
   deleted: (at v3 l4)
   added: (at v3 l12)
   goals met: 11 of 13
61. (drive v4 l11 l9)
   deleted: (at v4 l11)
   added: (at v4 l9)
   goals met: 11 of 13
62. (drive v4 l9 l13)
   deleted: (at v4 l9)
   added: (at v4 l13)
   goals met: 11 of 13
63. (pick-up v4 l13 p13 c1 c2)
   deleted: (at p13 l13) (capacity v4 c2)
   added: (in p13 v4) (capacity v4 c1)
   goals met: 11 of 13
64. (drive v4 l13 l9)
   deleted: (at v4 l13)
   added: (at v4 l9)
   goals met: 11 of 13
65. (drive v4 l9 l4)
   deleted: (at v4 l9)
   added: (at v4 l4)
   goals met: 11 of 13
66. (drop v4 l4 p13 c1 c2)
   deleted: (in p13 v4) (capacity v4 c1)
   added: (at p13 l4) (capacity v4 c2)
   goals met: 12 of 13
67. (drive v3 l12 l3)
   deleted: (at v3 l12)
   added: (at v3 l3)
   goals met: 12 of 13
68. (drop v3 l3 p12 c0 c1)
   deleted: (in p12 v3) (capacity v3 c0)
   added: (at p12 l3) (capacity v3 c1)
   goals met: 13 of 13
